      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
         77 WS-ACEITA PIC X(10) VALUE SPACE.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.


            DISPLAY "Hello world"
            ACCEPT WS-ACEITA
            DISPLAY WS-ACEITA
            STOP RUN.




       END PROGRAM YOUR-PROGRAM-NAME.
