      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.


           PERFORM S1.

           S1 SECTION.
           P1-INICIO.
               DISPLAY "HELLO 1".
           P1-FIM.

           P2-INICIO.
               DISPLAY "fIM".
           P2-FIM.

           P3-INICIO.
               STOP RUN.
           P3-FIM.


       END PROGRAM YOUR-PROGRAM-NAME.
